const str = `Австралія Австралія	036	AUS	AU	ISO 3166-2:AU
Австрія Австрія	040	AUT	AT	ISO 3166-2:AT
Азербайджан Азербайджан	031	AZE	AZ	ISO 3166-2:AZ
Аландські острови Аландські острови	248	ALA	AX	ISO 3166-2:AX
Албанія Албанія	008	ALB	AL	ISO 3166-2:AL
Алжир Алжир	012	DZA	DZ	ISO 3166-2:DZ
Американське Самоа Американське Самоа	016	ASM	AS	ISO 3166-2:AS
Американські Віргінські Острови Американські Віргінські Острови	850	VIR	VI	ISO 3166-2:VI
Ангілья Ангілья	660	AIA	AI	ISO 3166-2:AI
Ангола Ангола	024	AGO	AO	ISO 3166-2:AO
Андорра Андорра	020	AND	AD	ISO 3166-2:AD
Антарктида Антарктида	010	ATA	AQ	ISO 3166-2:AQ
Антигуа і Барбуда Антигуа і Барбуда	028	ATG	AG	ISO 3166-2:AG
Аргентина Аргентина	032	ARG	AR	ISO 3166-2:AR
Аруба Аруба	533	ABW	AW	ISO 3166-2:AW
Афганістан Афганістан	004	AFG	AF	ISO 3166-2:AF
Багамські Острови Багамські Острови	044	BHS	BS	ISO 3166-2:BS
Бангладеш Бангладеш	050	BGD	BD	ISO 3166-2:BD
Барбадос Барбадос	052	BRB	BB	ISO 3166-2:BB
Бахрейн Бахрейн	048	BHR	BH	ISO 3166-2:BH
Беліз Беліз	084	BLZ	BZ	ISO 3166-2:BZ
Бельгія Бельгія	056	BEL	BE	ISO 3166-2:BE
Бенін Бенін	204	BEN	BJ	ISO 3166-2:BJ
Бермудські Острови Бермудські Острови	060	BMU	BM	ISO 3166-2:BM
Білорусь Білорусь	112	BLR	BY	ISO 3166-2:BY
Болгарія Болгарія	100	BGR	BG	ISO 3166-2:BG
Болівія Болівія	068	BOL	BO	ISO 3166-2:BO
Боснія і Герцеговина Боснія і Герцеговина	070	BIH	BA	ISO 3166-2:BA
Ботсвана Ботсвана	072	BWA	BW	ISO 3166-2:BW
Бразилія Бразилія	076	BRA	BR	ISO 3166-2:BR
Британська Територія в Індійському Океані Британська Територія в Індійському Океані	086	IOT	IO	ISO 3166-2:IO
Британські Віргінські Острови Британські Віргінські Острови	092	VGB	VG	ISO 3166-2:VG
Бруней Бруней	096	BRN	BN	ISO 3166-2:BN
Буркіна-Фасо Буркіна-Фасо	854	BFA	BF	ISO 3166-2:BF
Бурунді Бурунді	108	BDI	BI	ISO 3166-2:BI
Бутан Бутан	064	BTN	BT	ISO 3166-2:BT
Вануату Вануату	548	VUT	VU	ISO 3166-2:VU
Ватикан Ватикан	336	VAT	VA	ISO 3166-2:VA
Велика Британія Велика Британія	826	GBR	GB	ISO 3166-2:GB
Венесуела Венесуела	862	VEN	VE	ISO 3166-2:VE
В'єтнам В'єтнам	704	VNM	VN	ISO 3166-2:VN
Вірменія Вірменія	051	ARM	AM	ISO 3166-2:AM
Волліс і Футуна Волліс і Футуна	876	WLF	WF	ISO 3166-2:WF
Габон Габон	266	GAB	GA	ISO 3166-2:GA
Гаїті Гаїті	332	HTI	HT	ISO 3166-2:HT
Гаяна Гаяна	328	GUY	GY	ISO 3166-2:GY
Гамбія Гамбія	270	GMB	GM	ISO 3166-2:GM
Гана Гана	288	GHA	GH	ISO 3166-2:GH
Гваделупа Гваделупа	312	GLP	GP	ISO 3166-2:GP
Гватемала Гватемала	320	GTM	GT	ISO 3166-2:GT
Гвінея Гвінея	324	GIN	GN	ISO 3166-2:GN
Гвінея-Бісау Гвінея-Бісау	624	GNB	GW	ISO 3166-2:GW
Гернсі Гернсі	831	GGY	GG	ISO 3166-2:GG
Гондурас Гондурас	340	HND	HN	ISO 3166-2:HN
Гонконг Гонконг	344	HKG	HK	ISO 3166-2:HK
Гренада Гренада	308	GRD	GD	ISO 3166-2:GD
Греція Греція	300	GRC	GR	ISO 3166-2:GR
Грузія Грузія	268	GEO	GE	ISO 3166-2:GE
Гуам Гуам	316	GUM	GU	ISO 3166-2:GU
Гібралтар Гібралтар	292	GIB	GI	ISO 3166-2:GI
Гренландія Гренландія	304	GRL	GL	ISO 3166-2:GL
Данія Данія	208	DNK	DK	ISO 3166-2:DK
ДР Конго ДР Конго	180	COD	CD	ISO 3166-2:CD
Джерсі Джерсі	832	JEY	JE	ISO 3166-2:JE
Джибуті Джибуті	262	DJI	DJ	ISO 3166-2:DJ
Домініка Домініка	212	DMA	DM	ISO 3166-2:DM
Домініканська Республіка Домініканська Республіка	214	DOM	DO	ISO 3166-2:DO
Зовнішні малі острови США Зовнішні малі острови США	581	UMI	UM	ISO 3166-2:UM
Еквадор Еквадор	218	ECU	EC	ISO 3166-2:EC
Екваторіальна Гвінея Екваторіальна Гвінея	226	GNQ	GQ	ISO 3166-2:GQ
Еритрея Еритрея	232	ERI	ER	ISO 3166-2:ER
Естонія Естонія	233	EST	EE	ISO 3166-2:EE
Ефіопія Ефіопія	231	ETH	ET	ISO 3166-2:ET
Єгипет Єгипет	818	EGY	EG	ISO 3166-2:EG
Ємен Ємен	887	YEM	YE	ISO 3166-2:YE
Замбія Замбія	894	ZMB	ZM	ISO 3166-2:ZM
Західна Сахара Західна Сахара	732	ESH	EH	ISO 3166-2:EH
Зімбабве Зімбабве	716	ZWE	ZW	ISO 3166-2:ZW
Ізраїль Ізраїль	376	ISR	IL	ISO 3166-2:IL
Індія Індія	356	IND	IN	ISO 3166-2:IN
Індонезія Індонезія	360	IDN	ID	ISO 3166-2:ID
Ірак Ірак	368	IRQ	IQ	ISO 3166-2:IQ
Іран Іран	364	IRN	IR	ISO 3166-2:IR
Ірландія Ірландія	372	IRL	IE	ISO 3166-2:IE
Ісландія Ісландія	352	ISL	IS	ISO 3166-2:IS
Іспанія Іспанія	724	ESP	ES	ISO 3166-2:ES
Італія Італія	380	ITA	IT	ISO 3166-2:IT
Йорданія Йорданія	400	JOR	JO	ISO 3166-2:JO
Кабо-Верде Кабо-Верде	132	CPV	CV	ISO 3166-2:CV
Казахстан Казахстан	398	KAZ	KZ	ISO 3166-2:KZ
Кайманові Острови Кайманові Острови	136	CYM	KY	ISO 3166-2:KY
Камбоджа Камбоджа	116	KHM	KH	ISO 3166-2:KH
Камерун Камерун	120	CMR	CM	ISO 3166-2:CM
Канада Канада	124	CAN	CA	ISO 3166-2:CA
Катар Катар	634	QAT	QA	ISO 3166-2:QA
Кенія Кенія	404	KEN	KE	ISO 3166-2:KE
Киргизстан Киргизстан	417	KGZ	KG	ISO 3166-2:KG
КНР Китайська Народна Республіка	156	CHN	CN	ISO 3166-2:CN
Кіпр Кіпр	196	CYP	CY	ISO 3166-2:CY
Кірибаті Кірибаті	296	KIR	KI	ISO 3166-2:KI
Кокосові острови Кокосові острови	166	CCK	CC	ISO 3166-2:CC
Колумбія Колумбія	170	COL	CO	ISO 3166-2:CO
Коморські Острови Коморські Острови	174	COM	KM	ISO 3166-2:KM
Республіка Конго Республіка Конго	178	COG	CG	ISO 3166-2:CG
Коста-Рика Коста-Рика	188	CRI	CR	ISO 3166-2:CR
Кот-д'Івуар Кот-д'Івуар	384	CIV	CI	ISO 3166-2:CI
Куба Куба	192	CUB	CU	ISO 3166-2:CU
Кувейт Кувейт	414	KWT	KW	ISO 3166-2:KW
Кюрасао Кюрасао	531	CUW	CW	ISO 3166-2:CW
Лаос Лаос	418	LAO	LA	ISO 3166-2:LA
Латвія Латвія	428	LVA	LV	ISO 3166-2:LV
Лесото Лесото	426	LSO	LS	ISO 3166-2:LS
Литва Литва	440	LTU	LT	ISO 3166-2:LT
Ліберія Ліберія	430	LBR	LR	ISO 3166-2:LR
Ліван Ліван	422	LBN	LB	ISO 3166-2:LB
Лівія Лівія	434	LBY	LY	ISO 3166-2:LY
Ліхтенштейн Ліхтенштейн	438	LIE	LI	ISO 3166-2:LI
Люксембург Люксембург	442	LUX	LU	ISO 3166-2:LU
Маврикій Маврикій	480	MUS	MU	ISO 3166-2:MU
Мавританія Мавританія	478	MRT	MR	ISO 3166-2:MR
Мадагаскар Мадагаскар	450	MDG	MG	ISO 3166-2:MG
Майотта Майотта	175	MYT	YT	ISO 3166-2:YT
Макао Макао	446	MAC	MO	ISO 3166-2:MO
Малаві Малаві	454	MWI	MW	ISO 3166-2:MW
Малайзія Малайзія	458	MYS	MY	ISO 3166-2:MY
Малі Малі	466	MLI	ML	ISO 3166-2:ML
Мальдіви Мальдіви	462	MDV	MV	ISO 3166-2:MV
Мальта Мальта	470	MLT	MT	ISO 3166-2:MT
Марокко Марокко	504	MAR	MA	ISO 3166-2:MA
Мартиніка Мартиніка	474	MTQ	MQ	ISO 3166-2:MQ
Маршаллові Острови Маршаллові Острови	584	MHL	MH	ISO 3166-2:MH
Мексика Мексика	484	MEX	MX	ISO 3166-2:MX
Мозамбік Мозамбік	508	MOZ	MZ	ISO 3166-2:MZ
Молдова Молдова	498	MDA	MD	ISO 3166-2:MD
Монако Монако	492	MCO	MC	ISO 3166-2:MC
Монголія Монголія	496	MNG	MN	ISO 3166-2:MN
Монтсеррат Монтсеррат	500	MSR	MS	ISO 3166-2:MS
М'янма М'янма	104	MMR	MM	ISO 3166-2:MM
Намібія Намібія	516	NAM	NA	ISO 3166-2:NA
Науру Науру	520	NRU	NR	ISO 3166-2:NR
Непал Непал	524	NPL	NP	ISO 3166-2:NP
Нігер Нігер	562	NER	NE	ISO 3166-2:NE
Нігерія Нігерія	566	NGA	NG	ISO 3166-2:NG
Нідерланди Нідерланди	528	NLD	NL	ISO 3166-2:NL
Нідерландські Антильські острови Нідерландські Антильські острови	530	ANT	AN	ISO 3166-2:AN
Карибські Нідерланди Карибські Нідерланди	535	BES	BQ	ISO 3166-2:BQ
Нікарагуа Нікарагуа	558	NIC	NI	ISO 3166-2:NI
Німеччина Німеччина	276	DEU	DE	ISO 3166-2:DE
Ніуе Ніуе	570	NIU	NU	ISO 3166-2:NU
Нова Зеландія Нова Зеландія	554	NZL	NZ	ISO 3166-2:NZ
Нова Каледонія Нова Каледонія	540	NCL	NC	ISO 3166-2:NC
Норвегія Норвегія	578	NOR	NO	ISO 3166-2:NO
ОАЕ ОАЕ	784	ARE	AE	ISO 3166-2:AE
Оман Оман	512	OMN	OM	ISO 3166-2:OM
Острів Буве Острів Буве	074	BVT	BV	ISO 3166-2:BV
Острів Мен Острів Мен	833	IMN	IM	ISO 3166-2:IM
Острів Норфолк Острів Норфолк	574	NFK	NF	ISO 3166-2:NF
Острів Різдва Острів Різдва	162	CXR	CX	ISO 3166-2:CX
Острови Святої Єлени, Вознесіння і Тристан-да-Кунья Острови Святої Єлени, Вознесіння і Тристан-да-Кунья	654	SHN	SH	ISO 3166-2:SH
Острів Херд і острови Макдональд Острів Херд і острови Макдональд	334	HMD	HM	ISO 3166-2:HM
Острови Кука Острови Кука	184	COK	CK	ISO 3166-2:CK
Пакистан Пакистан	586	PAK	PK	ISO 3166-2:PK
Палау Палау	585	PLW	PW	ISO 3166-2:PW
Палестина Палестина	275	PSE	PS	ISO 3166-2:PS
Панама Панама	591	PAN	PA	ISO 3166-2:PA
Папуа Нова Гвінея Папуа Нова Гвінея	598	PNG	PG	ISO 3166-2:PG
Парагвай Парагвай	600	PRY	PY	ISO 3166-2:PY
Перу Перу	604	PER	PE	ISO 3166-2:PE
ПАР ПАР	710	ZAF	ZA	ISO 3166-2:ZA
Південна Джорджія та Південні Сандвічеві Острови Південна Джорджія та Південні Сандвічеві Острови	239	SGS	GS	ISO 3166-2:GS
Південна Корея Південна Корея	410	KOR	KR	ISO 3166-2:KR
Південний Судан Південний Судан	728	SSD	SS	ISO 3166-2:SS
Північна Корея Північна Корея	408	PRK	KP	ISO 3166-2:KP
Північна Македонія Північна Македонія	807	MKD	MK	ISO 3166-2:MK
Північні Маріанські Острови Північні Маріанські Острови	580	MNP	MP	ISO 3166-2:MP
Піткерн Піткерн	612	PCN	PN	ISO 3166-2:PN
Польща Польща	616	POL	PL	ISO 3166-2:PL
Португалія Португалія	620	PRT	PT	ISO 3166-2:PT
Пуерто-Рико Пуерто-Рико	630	PRI	PR	ISO 3166-2:PR
Реюньйон Реюньйон	638	REU	RE	ISO 3166-2:RE
Росія Росія	643	RUS	RU	ISO 3166-2:RU
Руанда Руанда	646	RWA	RW	ISO 3166-2:RW
Румунія Румунія	642	ROU	RO	ISO 3166-2:RO
Сальвадор Сальвадор	222	SLV	SV	ISO 3166-2:SV
Самоа Самоа	882	WSM	WS	ISO 3166-2:WS
Сан-Марино Сан-Марино	674	SMR	SM	ISO 3166-2:SM
Сан-Томе і Принсіпі Сан-Томе і Принсіпі	678	STP	ST	ISO 3166-2:ST
Саудівська Аравія Саудівська Аравія	682	SAU	SA	ISO 3166-2:SA
Есватіні Есватіні	748	SWZ	SZ	ISO 3166-2:SZ
Свальбард і Ян-Маєн Свальбард і Ян-Маєн	744	SJM	SJ	ISO 3166-2:SJ
Сейшельські Острови Сейшельські Острови	690	SYC	SC	ISO 3166-2:SC
Сен-Бартелемі Сен-Бартелемі	652	BLM	BL	ISO 3166-2:BL
Сенегал Сенегал	686	SEN	SN	ISO 3166-2:SN
Сен-Мартен Сен-Мартен	663	MAF	MF	ISO 3166-2:MF
Сен-П'єр і Мікелон Сен-П'єр і Мікелон	666	SPM	PM	ISO 3166-2:PM
Сент-Вінсент і Гренадини Сент-Вінсент і Гренадини	670	VCT	VC	ISO 3166-2:VC
Сент-Кіттс і Невіс Сент-Кіттс і Невіс	659	KNA	KN	ISO 3166-2:KN
Сент-Люсія Сент-Люсія	662	LCA	LC	ISO 3166-2:LC
Сербія Сербія	688	SRB	RS	ISO 3166-2:RS
Сирія Сирія	760	SYR	SY	ISO 3166-2:SY
Сінгапур Сінгапур	702	SGP	SG	ISO 3166-2:SG
Сінт-Мартен Сінт-Мартен	534	SXM	SX	ISO 3166-2:SX
Словаччина Словаччина	703	SVK	SK	ISO 3166-2:SK
Словенія Словенія	705	SVN	SI	ISO 3166-2:SI
Соломонові Острови Соломонові Острови	090	SLB	SB	ISO 3166-2:SB
Сомалі Сомалі	706	SOM	SO	ISO 3166-2:SO
США США	840	USA	US	ISO 3166-2:US
Судан Судан	729	SDN	SD	ISO 3166-2:SD
Суринам Суринам	740	SUR	SR	ISO 3166-2:SR
Східний Тимор Східний Тимор	626	TLS	TL	ISO 3166-2:TL
Сьєрра-Леоне Сьєрра-Леоне	694	SLE	SL	ISO 3166-2:SL
Таджикистан Таджикистан	762	TJK	TJ	ISO 3166-2:TJ
Таїланд Таїланд	764	THA	TH	ISO 3166-2:TH
Тайвань Тайвань	158	TWN	TW	ISO 3166-2:TW
Танзанія Танзанія	834	TZA	TZ	ISO 3166-2:TZ
Острови Теркс і Кайкос Острови Теркс і Кайкос	796	TCA	TC	ISO 3166-2:TC
Того Того	768	TGO	TG	ISO 3166-2:TG
Токелау Токелау	772	TKL	TK	ISO 3166-2:TK
Тонга Тонга	776	TON	TO	ISO 3166-2:TO
Тринідад і Тобаго Тринідад і Тобаго	780	TTO	TT	ISO 3166-2:TT
Тувалу Тувалу	798	TUV	TV	ISO 3166-2:TV
Туніс Туніс	788	TUN	TN	ISO 3166-2:TN
Туреччина Туреччина	792	TUR	TR	ISO 3166-2:TR
Туркменістан Туркменістан	795	TKM	TM	ISO 3166-2:TM
Уганда Уганда	800	UGA	UG	ISO 3166-2:UG
Угорщина Угорщина	348	HUN	HU	ISO 3166-2:HU
Узбекистан Узбекистан	860	UZB	UZ	ISO 3166-2:UZ
Україна Україна	804	UKR	UA	ISO 3166-2:UA
Уругвай Уругвай	858	URY	UY	ISO 3166-2:UY
Фарерські острови Фарерські острови	234	FRO	FO	ISO 3166-2:FO
Федеративні Штати Мікронезії Федеративні Штати Мікронезії	583	FSM	FM	ISO 3166-2:FM
Фіджі Фіджі	242	FJI	FJ	ISO 3166-2:FJ
Філіппіни Філіппіни	608	PHL	PH	ISO 3166-2:PH
Фінляндія Фінляндія	246	FIN	FI	ISO 3166-2:FI
Фолклендські Острови Фолклендські Острови	238	FLK	FK	ISO 3166-2:FK
Франція Франція	250	FRA	FR	ISO 3166-2:FR
Французька Гвіана Французька Гвіана	254	GUF	GF	ISO 3166-2:GF
Французька Полінезія Французька Полінезія	258	PYF	PF	ISO 3166-2:PF
Французькі Південні і Антарктичні Території Французькі Південні і Антарктичні Території	260	ATF	TF	ISO 3166-2:TF
Хорватія Хорватія	191	HRV	HR	ISO 3166-2:HR
Центральноафриканська Республіка Центральноафриканська Республіка	140	CAF	CF	ISO 3166-2:CF
Чад Чад	148	TCD	TD	ISO 3166-2:TD
Чехія Чехія	203	CZE	CZ	ISO 3166-2:CZ
Чилі Чилі	152	CHL	CL	ISO 3166-2:CL
Чорногорія Чорногорія	499	MNE	ME	ISO 3166-2:ME
Швейцарія Швейцарія	756	CHE	CH	ISO 3166-2:CH
Швеція Швеція	752	SWE	SE	ISO 3166-2:SE
Шрі-Ланка Шрі-Ланка	144	LKA	LK	ISO 3166-2:LK
Ямайка Ямайка	388	JAM	JM	ISO 3166-2:JM
Японія Японія	392	JPN	JP	ISO 3166-2:JP`;
const arr = str.split("\n");
const arr2 = arr.map((item) => item.split("\t"));
const obj = {};
for (let i = 0; i < arr2.length; i += 1) {
    const out = arr2[i][0].trim().split("");
    const out2 = out.splice(out.length / 2 + 1, out.length / 2);
    obj[arr2[i][3]] = out2.join("");
}

//console.log(JSON.stringify(obj));

export const formatDate = (dt) => {
    const days = {
        0: { min: "Пн", full: "Понеділок" },
        1: { min: "Вт", full: "Вівторок" },
        2: { min: "Ср", full: "Середа" },
        3: { min: "Чт", full: "Четвер" },
        4: { min: "Пт", full: "Пятниця" },
        5: { min: "Сб", full: "Субота" },
        6: { min: "Нд", full: "Неділля" },
    };
    const monthes = {
        0: { min: "Січ", full: "Січень" },
        1: { min: "Лют", full: "Лютий" },
        2: { min: "Берез", full: "Березень" },
        3: { min: "Квіт", full: "Квітень" },
        4: { min: "Трав", full: "Травень" },
        5: { min: "Черв", full: "Червень" },
        6: { min: "Лип", full: "Липень" },
        7: { min: "Серп", full: "Серпень" },
        8: { min: "Верес", full: "Вересень" },
        9: { min: "Жовт", full: "Жовтень" },
        10: { min: "Листоп", full: "Листопад" },
        11: { min: "Груд", full: "Грудень" },
    };

    const date = new Date(dt * 1000);
    const m = monthes[date.getMonth()].min;
    const d = days[date.getDay()].min;

    let dd = date.getDate();
    if (dd < 10) dd = "0" + dd;

    let mm = date.getMonth() + 1;
    if (mm < 10) mm = "0" + mm;

    let yyyy = date.getFullYear();

    let min = date.getMinutes();
    if (min < 10) min = "0" + min;

    let Hour = date.getHours();
    if (Hour < 10) Hour = "0" + Hour;

    return [
        dd + "." + mm + "." + yyyy,
        d + ". " + dd + " " + m + ". " + Hour + ":" + min,
        d + ". " + dd + " ",
    ];
};

export const windWay = (windDeg) => {
    const rules = {
        0: { full: "Північний", min: "Пн" },
        1: { full: "Північно - Східний", min: "Пн - Сх" },
        2: { full: "Східний", min: "ПСх" },
        3: { full: "Південно - Східний", min: "Пд - Сх" },
        4: { full: "Південний", min: "Пд" },
        5: { full: "Південно - Західний", min: "Пд - Зх" },
        6: { full: "Західний", min: "Зх" },
        7: { full: "Північно - Західний", min: "Пн - Зх" },
    };
    const sector = (windDeg - 23) / 45;
    return rules[sector.toFixed()];
};
